# # 같은것이 있는 순열..?
# n[i] = n[i-1] + n[i-2] + n[i-3] (i>=4)

# 1 2 3 4 5  6
# 1 2 4 7 13 24

# 3 -> 4
# 111
# 12
# 21
# 3


# 4 -> 7
# 1111
# 112
# 121
# 211
# 13
# 31

# 5 -> 13
# 11111
# 1112 4*3*2*1/3*2*1*1
# 1121
# 1211
# 2111
# 122 3*2*1/2*1
# 212
# 221
# 311
# 131
# 113
# 32
# 23

# 6 24
# 111111 1
# 11112 5 2개 선택 5자리
# 11121
# 11211
# 12111
# 21111
# 1122 4*3*2*1/2*1*2*1 = 6 2개 선택 4자리
# 1212
# 2112
# 1221
# 2211
# 2121
# 1113 4*3*2*1/3*2*1 = 4 2개 선택 4자리
# 1131
# 1311
# 3111
# 321 3*2*1 = 6 3개 선택 3자리
# 123
# 231
# 132
# 312
# 213
# **222 1 얘를 못찾아서 점화식을 못 구하고 있었다...
# 33  1


t = int(input())
for _ in range(t) :
    n = int(input())
    arr = [0]*(n+1)
    # n이 2인경우 3까지 크기가 확장인 안됐는데 자꾸 값 넣으려 하니까 인덱스 에러가 나는거임
    for k in range (1,n+1) :
        if k == 1 : arr[k] = 1
        elif k == 2 : arr[k] = 2
        elif k == 3 : arr[k] = 4
        else :
            arr[k] = arr[k-1] + arr[k-2] + arr[k-3]
    print(arr[n])


# 다른 풀이
# 배열을 11까지 다 값까지 할당해주고
# 테케 숫자 인덱스 바로 찾아서 출력해주기

arr2 = [0]*11
for k in range (1,11) :
        if k == 1 : arr2[k] = 1
        elif k == 2 : arr2[k] = 2
        elif k == 3 : arr2[k] = 4
        else :
            arr2[k] = arr2[k-1] + arr2[k-2] + arr2[k-3]

t = int(input())
for _ in range(t) :
     n = int(input())
     print(arr2[n])